In [3]:
import numpy as np
import pandas as pd

In [14]:
data = {
    "Name" : ["John","Kinny","pointer"],
    "Age" : [24,53,34],
    "Salary": [3533,2443,56466],
    "Work Exprience" : [2,3,5,]
}

In [15]:
df = pd.DataFrame(data)

In [16]:
df

      Name  Age  Salary  Work Exprience
0     John   24    3533               2
1    Kinny   53    2443               3
2  pointer   34   56466               5

In [18]:
df.drop(["Name","Age"],axis = 1)  #Now this removing Function

   Salary  Work Exprience
0    3533               2
1    2443               3
2   56466               5

In [19]:
df

      Name  Age  Salary  Work Exprience
0     John   24    3533               2
1    Kinny   53    2443               3
2  pointer   34   56466               5

In [22]:
i = df.loc[1] ["Work Exprience"]

In [24]:
print(i)

3

In [26]:
df.loc[[1,2]]

      Name  Age  Salary  Work Exprience
1    Kinny   53    2443               3
2  pointer   34   56466               5

In [27]:
df

      Name  Age  Salary  Work Exprience
0     John   24    3533               2
1    Kinny   53    2443               3
2  pointer   34   56466               5

In [28]:
df["Designation"] = ["Hr","sbi","ubi"]

In [29]:
df

      Name  Age  Salary  Work Exprience Designation
0     John   24    3533               2          Hr
1    Kinny   53    2443               3         sbi
2  pointer   34   56466               5         ubi

In [38]:
df[(df["Age"] > 30) & (df["Work Exprience"] < 4)]

    Name  Age  Salary  Work Exprience Designation
1  Kinny   53    2443               3         sbi